function readValue() {
  var formName = document.getElementById('name-input').value;
  var output = document.getElementById('output');
  
  var sound = "";
  var Text = " لاتوجد نتائج ";
  var name = "";
  var name2 = "";
  var name3 = "";
  var name4 = "";
  var Text2 = "";
  var Text3 = "";
  var img = "";
  var f1="";
  var f2="";
  var f3="";
  var f4="";
  var f5="";
  var f6="";
  var f7="";
  var f8="";
  var f9="";
  var f10="";
  var f11="";
  var f12="";
  var f13="";
  var f14="";
  var img="";
  var srs="";
    var dd="";
    var fff="";
var f44="";
  switch(formName.toLowerCase()) {
   
   
   
    case '':
      Text="لم تقم بكتابة شيء";
      break;
      
      case 'العزم':
       Text="قانون العزم";
       img="a.png";
       f44="رمزه هو الحرف الإغريقي تاو";
       fff="قانون العزم :";
       Text3="عزم الدوران او القوة (بالإنجليزية: torque) في الفيزياء هو قيمة متجهة لقياس مدى قدرة قوة على تدوير المجســّـم حول محور ما، يعرف مقدار عزم الدوران على أنه حاصل ضرب القوة بطول الذراع، وبخلاف القوة التي يمكن أن تكون جاذبة أو دافعة، فعزم الدوران يمكن أن يكون تزاوج الإثنين";
      break;
          case 'السرعة الزاوية المتجهة':
       Text="قانون السرعة الزاوية المتجهة";
       img="sz.png";
       f44="رمزها هو الحرف اوميغا";
       fff="قانون السرعة الزاوية المتجهة :";
       Text3="في الفيزياء، السرعة الزاوية هي متجهة التي تعبر عن التردد الزاوي والمحور الذي يدور حوله الجسم. وحدة قياس السرعة الزاوية في نظام الوحدات الدولي هي الراديان/ثانية ، ومن الممكن قياسها بواحدات أخرى مثل درجة في الثانية. عندما تُقاس بوحدة دورة في وحدة الزمن (دورة في الدقيقة ، أو دورة في الساعة...الخ) فإنه يطلق عليها اسم السرعة الدورانية.";
      break;
      case 'الزخم':
       Text="قانون الزخم";
       f44="رمزه هو  الحرف p";
       fff="قانون الزخم  :";
       img="z.png";
       Text3="الزخم (زخم الحركة) هو أحد الكميات الفيزيائية التي عرفت من خلال الفيزياء الكلاسيكية بأنها حاصل ضرب كتلة الجسم في سرعته، ينطبق على كمية الحركة أحد مبادئ الانحفاظ في الفيزياء الكلاسيكية وهو مبدأ حفظ الزخم أو قانون حفظ الزخم.";
      break;
         case 'التسارع الزاوي':
       Text="قانون التسارع الزاوي";
       f44="يرمز له بالحرف اليوناني الفا";
       fff="قانون التسارع الزاوي";
       img="ts.png";
       Text3="التسارع الزاوي هو معدل التغير في السرعة الزاوية بالنسبة للزمن. بوحدات SI يقاس التسارع الزاوي براديان\ثانية مربعة (rad/s2)";
      break;
       case 'نظرية الدفع - الزخم':
       Text="قانون نظرية الدفع -الزخم";
       f44="رمزه هو f دلتا t";
       fff="قانون النظرية";
       img="dz.png";
       Text3="";
      break;
         case '':
       Text="";
       f44="";
       fff="";
       img="r.jpg";
       Text3="";
      break;
  }
output.innerHTML ='<h1 class="z">' + sound + '</h1>' + '<div class="ui raised segment" id="textbox">' + '<br/>' + '<h3>' + Text + '</h3>' + '<h5>' + f1 + '</h5>' + '<h5>' + f44 + '</h5>' + '<br/>' + '<br/>' + '<p class="p">' + Text3 + '</p>' + '<br/>' + '<h5>' + fff + '</h5>' + '<br/>' + '<img src=" ' + img + ' ">' + '<p>' + name + '</p>' + '<h3>' +  name4 + '</h3>' + '<h3>' + Text2 + '</h3>' + '<h6>' + name2 + '</h6>' + '<h5 class="aa">' + name3 + '<b class="bc">' + f13 + '</b>' + '</h5>' + '<h5 class="aa" >' + f6 + '</h5>' + '<h5 class="aa">' + f2 + '<b class="bc">' + f13 + '</b>' + '</h5>' + '<h5 class="aa">' + f7 + '</h5>' + '<h5 class="aa">' + f3 + '<b class="bc">' + f13 + '</b>' + '</h5>' + '<h5 class="aa">' + f8 + '</h5>' + '<h5 class="aa">' + f5 + '<b class="bc">' + f13 + '</b>' + '</h5>' + '<h5 class="aa">' + f10 + '</h5>' + '<h5 class="aa">' + f12 + '</h5>' + '<h5 class="aa">' + f4 + '<b class="bc">' + f13 + '</b>' + '</h5>' + '<h5 class="aa">' + f11 + '</h5>' + '<h5 class="aa">' + f9 + '</h5>' + '<p class="p">' + f14 + '</p>' + '</div>';

}